# Гипотеза Коллатца
# Это одна из нерешенных проблем математики. Решать мы ее конечно не будем)
# Попробуем проверить а выполняется ли данная гипотеза.
# Гипотеза гласит, что если мы возьмем любое случайное число X и начнем формировать последовательность по правилам:
# 
# Если число четное, то делим его на 2
# Если число нечетное, то умножаем его на 3 и прибавляем 1
# То в итоге рано или поздно получим число 1.
# 
# Попробуем проверить действительно ли гипотеза работает. В этом задании нужно написать код, который для любого заданного числа вычисляет последовательность Коллатца. Числа последовательности нужно сложить в список и напечатать его. Также нужно напечатать количество шагов за которое последовательность сошлась к 1.
# 
# Links and materials
# https://ru.wikipedia.org/wiki/%D0%93%D0%B8%D0%BF%D0%BE%D1%82%D0%B5%D0%B7%D0%B0_%D0%9A%D0%BE%D0%BB%D0%BB%D0%B0%D1%82%D1%86%D0%B0
# https://www.w3schools.com/python/python_while_loops.asp

# Вместо ... твой код
...

# Для проверки запускаем файл
# python task.py